{
  "animationData": {
    "animation-angela-walk-run": {
      "title": "Angela - Gå- & løpesyklus",
      "teaser": "En karakteranimasjon som viser gå- og løpesykluser, laget i After Effects med DUIK-rigging på en Illustrator-forberedt vektorillustrasjon.",
      "description": "Denne animasjonen demonstrerer gå- og løpesyklusfundamenter ved bruk av DUIK-rigging i Adobe After Effects. Fokuset er på å vise rigging- og animasjonsarbeidsflyten snarere enn selve illustrasjonen.",
      "article": {
        "0": {
          "heading": "Prosjektoversikt",
          "content": "Denne animasjonen fokuserer på å demonstrere rigging- og animasjonsferdigheter snarere enn illustrasjon. Målet var å vise den tekniske arbeidsflyten med å forberede kunstverk for animasjon og bringe en karakter til liv gjennom gå- og løpesykluser ved bruk av bransjestandard verktøy."
        },
        "1": {
          "heading": "Illustrasjonskilde & Forberedelse",
          "content": "Grunnillustrasjonen ble hentet fra Freepik under en fri lisens. Selv om det ikke er mitt originale kunstverk, var modifikasjoner nødvendige for å gjøre den animasjonsklarr.\n\nViktige forberedelsesteg i Adobe Illustrator:\n\n• Separere illustrasjonen i individuelle lag for hver kroppsdel\n• Sikre at alle lag er riktig sekvensert for animasjonshierarkiet\n• Avrunde leddområder (knær, albuer, skuldre) for å skape overlappende former"
        },
        "2": {
          "heading": "Rigging med DUIK",
          "content": "DUIK er et kraftig rigging-tillegg for After Effects som muliggjør beinbasert karakteranimasjon. Etter å ha importert den forberedte Illustrator-filen, brukte jeg DUIK til å:\n\n• Lage en beinstruktur for karakterens lemmer\n• Sette opp invers kinematikk (IK) for naturlig ben- og armbevegelse\n• Etablere riktige foreldre-barn-forhold mellom kroppsdeler\n• Konfigurere kontrollere for effektiv animasjonsarbeidsflyt"
        },
        "3": {
          "heading": "Prosjektorganisering & Grunntilstand",
          "content": "En nøkkeldel av arbeidsflyten min er å opprettholde en ren prosjektstruktur i After Effects. Jeg organiserte kunstverket i separate mapper:\n\n• Originalt kunstverk - den importerte Illustrator-filen, urørt\n• Rig-komposisjon - en duplikat hvor all rigging ble anvendt\n• Animasjonskomposisjoner - separate komposisjoner for hver animasjon\n\nKritisk viktig, i rig-komposisjonen sørget jeg for at alle bein, posisjoner og rotasjoner er nullstilt for å matche nøyaktig hvordan illustrasjonen opprinnelig ble importert."
        },
        "4": {
          "heading": "Animasjonsprosess",
          "content": "Med riggen på plass animerte jeg gå- og løpesyklusene ved å sette keyframes for karakterens bevegelse. Gå- og løpesykluser er grunnleggende animasjonsøvelser som demonstrerer timing, vekt og momentum.\n\nMerk: Denne illustrasjonen og riggen er bevisst ikke perfekte—formålet er å demonstrere animasjons- og riggingarbeidsflyten snarere enn å skape et polert ferdig stykke."
        }
      }
    },
    "animation-angela-waving": {
      "title": "Angela - Vinker",
      "teaser": "En karakteranimasjon som utforsker armbevegelse og gest, laget med samme DUIK-rigg for å demonstrere variert animasjon på et enkelt karakteroppsett.",
      "description": "Bygget på samme riggede karakter, fokuserer denne animasjonen spesifikt på overkroppsbevegelse og uttrykksfull gest. Den demonstrerer hvordan en enkelt rigg kan produsere mangfoldig animasjon gjennom forskjellige keyframe-tilnærminger.",
      "article": {
        "0": {
          "heading": "Prosjektoversikt",
          "content": "Denne animasjonen bruker samme Angela-karakterrigg fra Gå- & løpesyklusprosjektet. Målet her var å utforske en annen type bevegelse—en enkel vinkegest—for å demonstrere allsidigheten til en godt konstruert rigg og øve på å animere overkropps- og armbevegelser spesifikt."
        },
        "1": {
          "heading": "Samme rigg, annen bevegelse",
          "content": "En av fordelene med karakterrigging er gjenbrukbarhet. I stedet for å lage en ny karakter fra bunnen av, gjenbruker denne animasjonen den eksisterende DUIK-riggen bygget i After Effects.\n\nGrunnillustrasjonen var samme frilisensierte ressurs fra Freepik, forberedt i Adobe Illustrator med separerte lag og avrundede ledd."
        },
        "2": {
          "heading": "Animere vinken",
          "content": "En vinkegest kan virke enkel, men den involverer flere animasjonshensyn:\n\n• Armrotasjon fra skulderleddet\n• Sekundær bevegelse i hånd og fingre\n• Subtil kroppsbevegelse for å støtte gesten\n• Timing som føles naturlig og vennlig\n\nDenne animasjonen fokuserer på overkroppen, holder bena relativt statiske mens armen utfører vinkebevegelsen."
        },
        "3": {
          "heading": "Læringsutbytte",
          "content": "Dette stykket demonstrerer at når du har en fungerende rigg, kan du produsere flere animasjoner relativt raskt. Tidsinvesteringen i rigging lønner seg når du skaper en serie animasjoner for samme karakter."
        }
      }
    },
    "animation-angela-scratching": {
      "title": "Angela - Klør seg i hodet",
      "teaser": "En karakterhandlingsanimasjon som demonstrerer mangfoldet av bevegelser mulig med en godt forberedt DUIK-rigg i After Effects.",
      "description": "Denne animasjonen viser en tenkegest—å klø seg i hodet—ved bruk av samme riggede karakter. Den demonstrerer hvordan investering av tid i riktig riggingforberedelse muliggjør rask oppretting av varierte animasjoner.",
      "article": {
        "0": {
          "heading": "Prosjektoversikt",
          "content": "Dette er den tredje animasjonen laget med Angela-karakterriggen, og demonstrerer en ettertenksom klø-seg-i-hodet-gest. Som Gå- & løpesyklus- og Vinker-animasjonene bruker dette stykket samme DUIK-rigg i After Effects."
        },
        "1": {
          "heading": "Verdien av riggforberedelse",
          "content": "Alle tre Angela-animasjonene deler samme fundament: en karakterillustrasjon fra Freepik, forberedt i Adobe Illustrator med separerte lag, og rigget i After Effects med DUIK med en nullstilt grunntilstand.\n\nDenne forhåndsinvesteringen i forberedelse og organisering lønner seg betydelig."
        },
        "2": {
          "heading": "Karakterhandling",
          "content": "Denne animasjonen fokuserer på karakterhandling—å bringe personlighet til liv gjennom bevegelse. En klø-seg-i-hodet-gest formidler tanke, forvirring eller ettertanke. Det er en relaterbar menneskelig handling som hjelper seere med å koble seg til karakteren.\n\nNøkkelelementer i denne animasjonen:\n\n• Armbevegelsebue som når opp til hodet\n• Håndinteraksjon med hodet/håret\n• Subtil kroppsforskyvning for å støtte gesten\n• Timing som antyder et tankefullt humør"
        },
        "3": {
          "heading": "Rom for forbedring",
          "content": "Som med de andre animasjonene i denne serien er dette stykket ikke fullt polert. Fokuset var på å demonstrere riggingarbeidsflyten og vise mangfoldet av animasjoner mulig med en enkelt rigg, snarere enn å skape et produksjonsklart stykke."
        }
      }
    },
    "animation-lake-scene": {
      "title": "Innsjøscene - Dag til natt",
      "teaser": "En seerisk animasjon som viser miljøanimasjonsteknikker ved bruk av Puppet Pin-verktøyet og lagkomposisjon i After Effects.",
      "description": "Denne animasjonen demonstrerer en annen tilnærming til After Effects-animasjon—i stedet for karakterrigging med DUIK, bruker dette stykket Puppet Pin-verktøyet og lagkomposisjon for å bringe en innsjøsceneillustrasjon til liv med en dag-til-natt-overgang.",
      "article": {
        "0": {
          "heading": "Prosjektoversikt",
          "content": "Denne animasjonen tar en annen tilnærming enn Angela-karakteranimasjonene. I stedet for å bruke DUIK-rigging for karakterbevegelse, fokuserer dette stykket på miljøanimasjon—bringe en seerisk innsjøillustrasjon til liv ved bruk av Puppet Pin-verktøyet, lagkomposisjon og lysjusteringer for å simulere en dag-til-natt-overgang."
        },
        "1": {
          "heading": "Illustrasjonsforberedelse",
          "content": "Som med karakteranimasjonene begynte arbeidsflyten i Adobe Illustrator. Illustrasjonen ble separert i individuelle lag—hvert element som trengte å bevege seg eller komposisjoneres separat fikk sitt eget lag.\n\nDette inkluderte separering av:\n\n• Bakgrunnshimmel og fjerne elementer\n• Skyer (flere lag for dybde)\n• Vann/innsjøoverflate\n• Forgrunnselementer"
        },
        "2": {
          "heading": "Animasjonsteknikker",
          "content": "I stedet for beinbasert rigging bruker denne animasjonen flere forskjellige teknikker:\n\n• Puppet Pin-verktøy - Brukes til å skape organiske, flytende bevegelser på elementer uten å trenge en full rigg\n\n• Lagkomposisjon - Bakgrunnselementer som skyer ble komposisjonert og animert i løkker\n\n• Lysstyrke/Kontrast-justeringer - Et justeringslag ble lagt til for gradvis å skifte belysningen, simulere overgangen fra dag til natt"
        },
        "3": {
          "heading": "Dag til natt-overgang",
          "content": "Den fremtredende funksjonen i denne animasjonen er lysovergangen. Ved å animere lysstyrke- og kontrastverdier over tid, mørkner scenen gradvis for å simulere at natten nærmer seg. Denne teknikken demonstrerer hvordan After Effects kan brukes ikke bare for bevegelse, men for å skape atmosfære og stemningsendringer."
        }
      }
    },
    "animation-3d-fire-scene": {
      "title": "3D Brannscene",
      "teaser": "En 3D-rendret scene som viser VFX-flammer, teksturer på 3D-objekter og dynamiske lyseffekter laget i Unreal Engine.",
      "description": "Denne 3D-scenen demonstrerer VFX-branneffekter, teksturanvendelse på 3D-objekter og belysningisteknikker i Unreal Engine. Fokuset er på å utforske hvordan disse elementene fungerer sammen for å skape visuell effekt.",
      "article": {
        "0": {
          "heading": "Prosjektoversikt",
          "content": "Denne 3D-scenen ble laget som en visning av hva som kan gjøres med Unreal Engine. Fokuset var på å utforske VFX-flammer, anvende teksturer på 3D-objekter og forstå hvordan belysning og bevegelse fungerer sammen for å skape visuell effekt i et sanntidsmiljø."
        },
        "1": {
          "heading": "VFX & Teksturer",
          "content": "Senterpunktet i denne scenen er VFX-flammeeffekten, som demonstrerer partikkelbasert ild i Unreal Engine. Utover flammene utforsker scenen også teksturanvendelse på 3D-objekter—forståelse av hvordan materialer og teksturer samhandler med belysning er fundamentalt for å skape overbevisende 3D-miljøer."
        },
        "2": {
          "heading": "Belysning & Bevegelse",
          "content": "Ilden fungerer som den primære lyskilden, og skaper dynamisk belysning over scenen. Å leke med lyseffekter og bevegelse var en nøkkeldel av denne utforskningen—forstå hvordan flakkende lys samhandler med teksturerte overflater og hvordan bevegelse tilfører liv til et statisk miljø."
        },
        "3": {
          "heading": "Læringsutbytte",
          "content": "Dette prosjektet var del av min reise med å lære Unreal Engine og sanntids 3D-grafikk. Selv om jeg primært fokuserer på 2D-illustrasjon og frontend-utvikling, gir forståelse av 3D-verktøy verdifull innsikt i visuell design, belysningsprinsipper og de tekniske aspektene ved moderne spillmotorer."
        }
      }
    },
    "animation-3d-cinematic-scene": {
      "title": "3D Cinematisk scene",
      "teaser": "Et skoleprosjekt som viser kamerabevegelser, lyseffekter og lyddesign i Unreal Engine.",
      "description": "Denne cinematiske scenen ble laget som et skoleprosjekt ved Høgskolen i Innlandet (spillskolen). Oppgaven var å vise frem en spesifikk gjenstand gjennom en cinematisk presentasjon, demonstrere kamerabevegelser, belysning og lyd i Unreal Engine.",
      "article": {
        "0": {
          "heading": "Prosjektoversikt",
          "content": "Denne cinematiske scenen ble laget som et skoleprosjekt under min tid ved Høgskolen i Innlandet (spillskolen). Oppgaven var å vise frem én spesifikk gjenstand gjennom en cinematisk presentasjon i Unreal Engine."
        },
        "1": {
          "heading": "Kamerabevegelser",
          "content": "Et hovedfokus i dette prosjektet var å utforske kameraarbeid inne i Unreal Engine. Ved bruk av Sequencer skapte jeg kamerabevegelser som leder seerens oppmerksomhet mot den utstilte gjenstanden."
        },
        "2": {
          "heading": "Belysning & Lyd",
          "content": "Utover kameraarbeid inkorporerer scenen også lyseffekter og lyddesign. Belysningen bidrar til å etablere stemning og trekker fokus til gjenstanden som vises, mens lyd tilfører et ekstra lag til presentasjonen."
        }
      }
    },
    "animation-3d-castle-scene": {
      "title": "3D Slottscene",
      "teaser": "En scene som viser 3D-objektkomposisjon, belysning og kamerabevegelser i Unreal Engine.",
      "description": "Denne slottscenen demonstrerer sammensetning av 3D-objekter til et sammenhengende miljø i Unreal Engine, med fokus på belysning, kamerabevegelser og subtile miljødetaljer som gressbevegelse og flamme-VFX.",
      "article": {
        "0": {
          "heading": "Prosjektoversikt",
          "content": "Dette prosjektet er en enkel visning av å sette sammen en scene i Unreal Engine. Målet var å demonstrere evnen til å sette sammen 3D-objekter til et sammenhengende miljø og presentere det gjennom forskjellige kameravinkler og bevegelser."
        },
        "1": {
          "heading": "Scenekomposisjon",
          "content": "Slottscenen ble bygget ved å kombinere ulike 3D-objekter for å skape miljøet. Fokuset var på å arrangere elementer på en visuelt tiltalende måte og bruke belysning for å sette stemningen. Små detaljer som gressbevegelse og flamme-VFX tilfører liv til scenen."
        },
        "2": {
          "heading": "Kamera & Belysning",
          "content": "Hovedvekten i dette prosjektet er på belysning og kameraarbeid. Forskjellige kamerabevegelser viser scenen fra ulike vinkler, mens belysningen bidrar til å etablere atmosfære og fremheve nøkkelområder i miljøet.\n\nDette er et ganske grunnleggende prosjekt, men det demonstrerer fundamentale ferdigheter i å jobbe med en spillmotor."
        }
      }
    },
    "animation-3d-gallery-scene": {
      "title": "3D Gallerimiljø",
      "teaser": "En interaktiv galleriopplevelse i Unreal Engine som fremhever plastforurensning i havet og innsats mot en renere fremtid.",
      "description": "Dette 3D-gallerimiljøet ble laget i Unreal Engine for å øke bevisstheten om plastforurensning i havene. Plassert på en øy omgitt av hav, går besøkende inn i et galleri som viser både problemet og de håpefulle anstrengelsene for å adressere det.",
      "article": {
        "0": {
          "heading": "Prosjektoversikt",
          "content": "Dette prosjektet er en galleriopplevelse bygget i Unreal Engine, med fokus på problemet med plastforurensning i havene våre. Galleriet presenterer begge sider av historien—fremhever hvordan søppel har blitt et stort problem i marine miljøer, samtidig som det viser en lysere fremtid der vi aktivt jobber for å samle inn og redusere denne forurensningen."
        },
        "1": {
          "heading": "Galleriopplevelsen",
          "content": "Inne i galleriet møter besøkende en blanding av forskjellige elementer:\n\n• Illustrasjoner vist i ulike former gjennom rommet\n• 3D-objekter relatert til havforurensningtemaet\n• Teksturerte overflater som simulerer vann og andre miljøelementer\n\nMålet var å skape en oppslukende opplevelse hvor spilleren kan utforske og reflektere over påvirkningen av plastforurensning."
        },
        "2": {
          "heading": "Kombinere 3D-elementer",
          "content": "Dette prosjektet involverte å bringe sammen flere elementer innen Unreal Engine—3D-objekter, illustrasjoner og teksturerte materialer som alle jobber sammen for å fortelle historien. Det var en øvelse i scenekomposisjon, materialanvendelse og bruk av et spillmotormiljø for å kommunisere et meningsfullt budskap."
        }
      }
    }
  }
}